In [1]:
# use use readxl::read_xlsx and readxl::read_xls for redaing excel files

In [2]:

library(tidyverse)

-- Attaching packages --------------------------------------- tidyverse 1.2.1 --
v ggplot2 3.2.1     v purrr   0.3.3
v tibble  3.0.1     v dplyr   0.8.3
v tidyr   1.0.0     v stringr 1.4.0
v readr   1.3.1     v forcats 0.4.0
Warning message:
"package 'tibble' was built under R version 3.6.3"Warning message:
"package 'stringr' was built under R version 3.6.3"-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

In [5]:
mtcars <- as_tibble(mtcars)

In [10]:
summarize(mtcars, n())

  n()
1 32

In [11]:
mtcars %>% print

# A tibble: 32 x 11
     mpg   cyl  disp    hp  drat    wt  qsec    vs    am  gear  carb
   <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl> <dbl>
 1  21       6  160    110  3.9   2.62  16.5     0     1     4     4
 2  21       6  160    110  3.9   2.88  17.0     0     1     4     4
 3  22.8     4  108     93  3.85  2.32  18.6     1     1     4     1
 4  21.4     6  258    110  3.08  3.22  19.4     1     0     3     1
 5  18.7     8  360    175  3.15  3.44  17.0     0     0     3     2
 6  18.1     6  225    105  2.76  3.46  20.2     1     0     3     1
 7  14.3     8  360    245  3.21  3.57  15.8     0     0     3     4
 8  24.4     4  147.    62  3.69  3.19  20       1     0     4     2
 9  22.8     4  141.    95  3.92  3.15  22.9     1     0     4     2
10  19.2     6  168.   123  3.92  3.44  18.3     1     0     4     4
# ... with 22 more rows

In [21]:
mtcars$gear %>% unique

[1] 4 3 5

In [25]:
mtcars$gear %>% unique %>% length

[1] 3

In [26]:
mtcars %>% summarize(n())

  n()
1 32

In [30]:
mtcars %>% group_by(`gear`) %>% summarize(n()) # you can use `` to caption the column name, good when columns names are numerals

  gear n()
1 3    15
2 4    12
3 5     5

In [32]:
mpg %>% head

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [36]:
mpg %>% group_by(class) %>% summarize(TotalCars=n())

  class      TotalCars
1 2seater     5
2 compact    47
3 midsize    41
4 minivan    11
5 pickup     33
6 subcompact 35
7 suv        62

In [37]:
mpg %>% group_by(class) %>% summarize(TotalCars=n()) %>% nrow

[1] 7

In [46]:
mpg %>% group_by(class) %>% summarize(avgMPG = mean(hwy, na.rm=T))

  class      avgMPG
1 2seater    24.80000
2 compact    28.29787
3 midsize    27.29268
4 minivan    22.36364
5 pickup     16.87879
6 subcompact 28.14286
7 suv        18.12903

In [47]:
mpg %>% group_by(class) %>% summarize(avgMPG = mean(hwy, na.rm=T), sdMPG = sd(hwy, na.rm=T))

  class      avgMPG   sdMPG
1 2seater    24.80000 1.303840
2 compact    28.29787 3.781620
3 midsize    27.29268 2.135930
4 minivan    22.36364 2.062655
5 pickup     16.87879 2.274280
6 subcompact 28.14286 5.375012
7 suv        18.12903 2.977973

In [54]:
mpg %>% select(model, ends_with('y')) %>% head(10)

   model      cty hwy
1  a4         18  29
2  a4         21  29
3  a4         20  31
4  a4         21  30
5  a4         16  26
6  a4         18  26
7  a4         18  27
8  a4 quattro 18  26
9  a4 quattro 16  25
10 a4 quattro 20  28

In [55]:
#  x %>% f is equivalent to f(x)
#  x %>% f() is equivalent to f(x)
#  x %>% f(y) is equivalent to f(x, y)
#  x %>% f(y, .) is equivalent to f(y, x)

In [56]:
library(magrittr)

Attaching package: 'magrittr'

The following object is masked from 'package:purrr':

    set_names

The following object is masked from 'package:tidyr':

    extract

In [69]:
mpg %<>% summarize(n()) #x %<>% f is equivalent to x <- f(x)

In [70]:
mpg
rm(mpg)

  n()
1 234

In [77]:
x <- mpg %$% class #useful for getting a vector out of dataframe

In [78]:
str(x) # a vector

 chr [1:234] "compact" "compact" "compact" "compact" "compact" "compact" ...

In [79]:
# gather, and spread(spread is inverse of gather)

In [80]:
pcr

ERROR: Error in eval(expr, envir, enclos): object 'pcr' not found

In [81]:
# pcr %>% gather(key = SampleID,value = Taxon,-SampleID)

In [82]:
# Good alternatives that I don’t use: reshape2 package and its
# functions melt, dcast, acast

In [83]:
# gather Reshaping wide format to long format

In [84]:
# gather() function will take multiple columns and collapse them into key-value pairs, duplicating all other columns as needed.

In [87]:
# ?gather

In [99]:
# install.packages('frailty')
# install.packages("C:\\Users\\solanjx\\Downloads\\dsr_0.2.2.tar.gz", repos = NULL, type="source")
# <https://garrettgman.github.io/tidying/>
library(dsr)

In [96]:
table2 # this needs to be untangled

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

In [103]:
#this will require spread
spread(table2, key='type', value='count')# so values in type column turns into key columns, 
#and values in value column turn into value for respective key

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

![gather](https://garrettgman.github.io/images/tidy-8.png)

In [104]:
# spread() adds a new column for each unique value of the key column

### gather is reverse of spread
`To use gather(), pass it the name of a data frame to reshape. Then pass gather() a character string to use for the name of the “key” column that it will make, as well as a character string to use as the name of the value column that it will make. Finally, specify which columns gather() should collapse into the key value pair`

In [119]:
#table4  # cases

## Source: local data frame [3 x 3]
## 
##       country   1999   2000
## 1 Afghanistan    745   2666
## 2      Brazil  37737  80488
## 3       China 212258 213766

In [169]:
table4 <- table3 %>% spread(key=year, value=rate) #wider form
# table4$`1999` <- split(table4$`1999`, '/')[1]
table4

  country     1999              2000
1 Afghanistan 745/19987071      2666/20595360
2 Brazil      37737/172006362   80488/174504898
3 China       212258/1272915272 213766/1280428583

In [170]:
table4 %<>% separate(`1999`, c('1999', NA)) %>% separate(`2000`, c('2000',NA))
table4

  country     1999   2000
1 Afghanistan 745    2666
2 Brazil      37737  80488
3 China       212258 213766

In [171]:
table4 %>% gather(key='year', value='cases', `1999`, `2000`) #longer form

  country     year cases
1 Afghanistan 1999 745
2 Brazil      1999 37737
3 China       1999 212258
4 Afghanistan 2000 2666
5 Brazil      2000 80488
6 China       2000 213766

In [172]:
# or
table4 %>% gather(key='year', value='cases', 2:3) #longer form

  country     year cases
1 Afghanistan 1999 745
2 Brazil      1999 37737
3 China       1999 212258
4 Afghanistan 2000 2666
5 Brazil      2000 80488
6 China       2000 213766

In [173]:
# or
table4 %>% gather(key='year', value='cases', `1999`:`2000`) #longer form

  country     year cases
1 Afghanistan 1999 745
2 Brazil      1999 37737
3 China       1999 212258
4 Afghanistan 2000 2666
5 Brazil      2000 80488
6 China       2000 213766

In [174]:
# or
table4 %>% gather(key='year', value='cases', -1) #longer form, -1 one means dont collapse 1st column

  country     year cases
1 Afghanistan 1999 745
2 Brazil      1999 37737
3 China       1999 212258
4 Afghanistan 2000 2666
5 Brazil      2000 80488
6 China       2000 213766

**separate()** `turns a single character column into multiple columns by splitting the values of the column wherever a separator character appears.`

In [175]:
#we can use separate() to tidy table3, which combines values of cases and population in the same column
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [179]:
separate(table3, col = rate, into = c("cases", "population"))

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [181]:
# or
separate(table3, col = rate, into = c("cases", "population"), sep = "/")
#By default, separate() will split values wherever a non-alphanumeric character appears

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [183]:
# You can also pass an integer or vector of integers to sep. separate() will interpret the integers as positions to split at
separate(table3, year, into = c("century", "year"), sep = 2)

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [184]:
# you may drop the colun you may not want after separating, use NA for that
separate(table3, col = rate, into = c("cases", NA), sep = "/")

  country     year cases
1 Afghanistan 1999 745
2 Afghanistan 2000 2666
3 Brazil      1999 37737
4 Brazil      2000 80488
5 China       1999 212258
6 China       2000 213766

**unite()** `does the opposite of separate(): it combines multiple columns into a single column.`

In [189]:
table6  <- separate(table3, col = rate, into = c("cases", 'population'), sep = "/")

In [190]:
table6

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [200]:
unite(table6, col = "rate", cases, population, sep = "/")

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

## Case Study
**WHO** Data
<br>
_part of library(dsr)_

In [203]:
who  %>% head()

  country     iso2 iso3 year new_sp_m014 new_sp_m1524 new_sp_m2534 new_sp_m3544
1 Afghanistan AF   AFG  1980 NA          NA           NA           NA
2 Afghanistan AF   AFG  1981 NA          NA           NA           NA
3 Afghanistan AF   AFG  1982 NA          NA           NA           NA
4 Afghanistan AF   AFG  1983 NA          NA           NA           NA
5 Afghanistan AF   AFG  1984 NA          NA           NA           NA
6 Afghanistan AF   AFG  1985 NA          NA           NA           NA
  new_sp_m4554 new_sp_m5564 ... newrel_m4554 newrel_m5564 newrel_m65
1 NA           NA           ... NA           NA           NA
2 NA           NA           ... NA           NA           NA
3 NA           NA           ... NA           NA           NA
4 NA           NA           ... NA           NA           NA
5 NA           NA           ... NA           NA           NA
6 NA           NA           ... NA           NA           NA
  newrel_f014 newrel_f1524 newrel_f2534 newrel_f3544 newrel_f4554 newrel_f5564
1 NA          NA           NA           NA           NA           NA
2 NA          NA           NA           NA           NA           NA
3 NA          NA           NA           NA           NA           NA
4 NA          NA           NA           NA           NA           NA
5 NA          NA           NA           NA           NA           NA
6 NA          NA           NA           NA           NA           NA
  newrel_f65
1 NA
2 NA
3 NA
4 NA
5 NA
6 NA

In [205]:
str(who)

tibble [7,240 x 60] (S3: tbl_df/tbl/data.frame)
 $ country     : chr [1:7240] "Afghanistan" "Afghanistan" "Afghanistan" "Afghanistan" ...
 $ iso2        : chr [1:7240] "AF" "AF" "AF" "AF" ...
 $ iso3        : chr [1:7240] "AFG" "AFG" "AFG" "AFG" ...
 $ year        : int [1:7240] 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 ...
 $ new_sp_m014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_m65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sp_f65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_m65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_sn_f65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_m65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ new_ep_f65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_m65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f014 : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f1524: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f2534: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f3544: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f4554: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f5564: int [1:7240] NA NA NA NA NA NA NA NA NA NA ...
 $ newrel_f65  : int [1:7240] NA NA NA NA NA NA NA NA NA NA ...

In [206]:
who <- gather(who, key = "code", value = "value", 5:60)

In [208]:
who  %>% head()

  country     iso2 iso3 year code        value
1 Afghanistan AF   AFG  1980 new_sp_m014 NA
2 Afghanistan AF   AFG  1981 new_sp_m014 NA
3 Afghanistan AF   AFG  1982 new_sp_m014 NA
4 Afghanistan AF   AFG  1983 new_sp_m014 NA
5 Afghanistan AF   AFG  1984 new_sp_m014 NA
6 Afghanistan AF   AFG  1985 new_sp_m014 NA

In [209]:
who <- separate(who, col = code, into = c("new", "var", "sexage"))
who %>% head()

Warning message:
"Expected 3 pieces. Missing pieces filled with `NA` in 101360 rows [304081, 304082, 304083, 304084, 304085, 304086, 304087, 304088, 304089, 304090, 304091, 304092, 304093, 304094, 304095, 304096, 304097, 304098, 304099, 304100, ...]."

  country     iso2 iso3 year new var sexage value
1 Afghanistan AF   AFG  1980 new sp  m014   NA
2 Afghanistan AF   AFG  1981 new sp  m014   NA
3 Afghanistan AF   AFG  1982 new sp  m014   NA
4 Afghanistan AF   AFG  1983 new sp  m014   NA
5 Afghanistan AF   AFG  1984 new sp  m014   NA
6 Afghanistan AF   AFG  1985 new sp  m014   NA

In [210]:
who <- separate(who, sexage, c("sex", "age"), sep = 1)
who  %>%  head()

  country     iso2 iso3 year new var sex age value
1 Afghanistan AF   AFG  1980 new sp  m   014 NA
2 Afghanistan AF   AFG  1981 new sp  m   014 NA
3 Afghanistan AF   AFG  1982 new sp  m   014 NA
4 Afghanistan AF   AFG  1983 new sp  m   014 NA
5 Afghanistan AF   AFG  1984 new sp  m   014 NA
6 Afghanistan AF   AFG  1985 new sp  m   014 NA

In [211]:
#  we can move the rel, ep, sn, and sp keys into their own column names with spread()
who <- spread(who, key = var, value = value)
who  %>% head()

  country     iso2 iso3 year new sex age ep f014 f1524 ... f65 m014 m1524 m2534
1 Afghanistan AF   AFG  1980 new m   014 NA NA   NA    ... NA  NA   NA    NA
2 Afghanistan AF   AFG  1981 new m   014 NA NA   NA    ... NA  NA   NA    NA
3 Afghanistan AF   AFG  1982 new m   014 NA NA   NA    ... NA  NA   NA    NA
4 Afghanistan AF   AFG  1983 new m   014 NA NA   NA    ... NA  NA   NA    NA
5 Afghanistan AF   AFG  1984 new m   014 NA NA   NA    ... NA  NA   NA    NA
6 Afghanistan AF   AFG  1985 new m   014 NA NA   NA    ... NA  NA   NA    NA
  m3544 m4554 m5564 m65 sn sp
1 NA    NA    NA    NA  NA NA
2 NA    NA    NA    NA  NA NA
3 NA    NA    NA    NA  NA NA
4 NA    NA    NA    NA  NA NA
5 NA    NA    NA    NA  NA NA
6 NA    NA    NA    NA  NA NA